GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f303v(b)xx-pinctrl.h
/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)
#define USART2_CK_PD10_NORMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_NORMP)
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PD11_NORMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PD11_RMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_RMP)

/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PD12_NORMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PD12_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_RMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)
#define USART2_RX_PD9_NORMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_NORMP)
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)
#define USART2_TX_PD8_NORMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_NORMP)
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBDM */
#define USBDM_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBDP */
#define USBDP_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
